** How to loadbalance with roundrobin
#+begin_src bash
docker run -d -p 2222:9999 -e APID=2222 nodeapp
docker run -d -p 3333:9999 -e APID=3333 nodeapp
docker run -d -p 4444:9999 -e APID=4444 nodeapp
docker run -d -p 5555:9999 -e APID=5555 nodeapp
#+end_src

#+RESULTS:
| bcdeb581ad353a9e353a37186a9de10385baf9b6f30e20e5cc3a782d6e1497ad |
| 80ecd5450e28dc4d4c752d5e50a13c206edb2201132a81e703956c3c9b5d9ee7 |
| e337829ab090934627f5f6c6d0819c188bcc5f8f947def14120243d825894245 |
| 7da1eeaa8c23e74e48a32300efbe8fa460f3264bcf9a1c5aec95038c356b41a1 |

#+begin_src conf
http {
    upstream allbackend {
        server 127.0.0.1:2222;
        server 127.0.0.1:3333;
        server 127.0.0.1:4444;
        server 127.0.0.1:5555;
    }

    server {
        listen 80;
        location / {
            proxy_pass http://allbackend/;
        }
    }
}
events {}
#+end_src

